{"basics":{"name":"Tianhao Fu","label":"AI Scientist","image":"/assets/img/portrait.jpg","email":"terry.fu@projectneura.org","url":"https://atatc.me","summary":"2T9 EngSci at University of Toronto; Research Team Lead at UTMIST; Intern at Vector Institute; Chief of Project Neura","location":{"city":"Toronto","countryCode":"CA","region":"Ontario"},"profiles":[{"network":"LinkedIn","username":"tianhao-fu-957188279","url":"https://www.linkedin.com/in/tianhao-fu-957188279"},{"network":"ORCID","username":"0009-0007-2342-5350","url":"https://orcid.org/0009-0007-2342-5350"},{"network":"Google Scholar","username":"_-yZgZ4AAAAJ","url":"https://scholar.google.com/citations?user=_-yZgZ4AAAAJ"},{"network":"X","username":"ATATC_A","url":"https://x.com/ATATC_A"}]},"work":[{"name":"Project Neura","position":"Chief","url":"https://projectneura.org","startDate":"2019-06-09","summary":"Gathering researchers and developers to bring their ideas into reality. Developed projects like LEADS and MIP Candy.","highlights":["Developed MIP Candy (A Candy for Medical Image Processing)","Developed LEADS (Lightweight Embedded Assisted Driving System)","Built an infrastructure cloud compute platform with Docker"]},{"name":"Vector Institute (Bo Wang Lab)","position":"Research Intern","url":"https://vectorinstitute.ai","startDate":"2024-08-01","summary":"Competing in medical AI challenges presented by MICCAI.","highlights":["Ranked 4th in the PANORAMA Challenge","Ranked 4th in the SegSTRONG-C Challenge","Helped with Fast nnU-Net"]},{"name":"University of Toronto Machine Intelligence Student Team","position":"Research Team Lead","url":"https://utmist.ca","startDate":"2025-09-04","summary":"The AIP Project.","highlights":["Developed the AIP Project (Automated Iterative Pseudo-labeling)"]}],"education":[{"institution":"Shanghai Southwest Weiyu Middle School","location":"China","url":"https://xnwy.xhedu.sh.cn/cms","studyType":"Compulsory Education","startDate":"2018-09-01","endDate":"2022-06-30"},{"institution":"St. Thomas of Villanova College","location":"Canada","url":"https://www.villanovacollege.org","studyType":"OSSD and AP","startDate":"2022-09-06","endDate":"2025-06-13","score":"97.33 / 100"},{"institution":"University of Toronto","location":"Canada","url":"https://www.engineering.utoronto.ca","area":"Engineering Science (PEY Co-op)","studyType":"BASc","startDate":"2025-09-02","score":"3.88 / 4.00; 88.2 / 100","courses":["Machine Intelligence"]}],"awards":[{"title":"Dean's Honour List","date":"2026","awarder":"University of Toronto","summary":"Awarded for outstanding academic performance."},{"title":"Digital Citizenship Graduation Award","date":"2025","awarder":"STEM Fellowship, Royal Bank of Canada, LinkedIn Learning, and Villanova College","url":"https://live.stemfellowship.org/digital-citizenship-graduation-award","summary":"In recognition of exemplary digital leadership and the promotion of Canadian values."},{"title":"Ontario Scholar","date":"2025","awarder":"Ontario Ministry of Education"}],"certificates":[{"name":"IELTS (8.0 / 9.0)","date":"2024-08-19","issuer":"British Council, IDP IELTS, and Cambridge University Press & Assessment","url":"https://www.ielts.ca","icon":"fa-solid fa-hashtag"}],"publications":[{"name":"A deep learning model for accurate and robust internet traffic classification","publisher":"Applied and Computational Engineering","releaseDate":"2023-06-14","url":"https://doi.org/10.54254/2755-2721/6/20230939","summary":"Network traffic classification is significant due to the fast growth of the number of internet users. The traditional way of classifying the large number of traffic generated by these users is becoming less effective. Therefore, many researchers made a network traffic classifier based on deep learning. However, those classifiers do not provide far better results and perform poorly when dealing with encrypted information. This paper tries to approach highly accurate and robust results in both encrypted and unencrypted networks by using machine learning algorithms. The algorithm used is the convolutional neural network (CNN). The performance of the proposed CNN is compared with that of the classical LeNet-5 network. Experimental results show that the classifier based on the proposed CNN performed better when dealing with both encrypted and unencrypted datasets, achieving a maximum average accuracy of 83.55%. Moreover, it is not sensitive to hyper-parameter choices, indicating its superiority in robustness. Compared with traditional network classifiers, the network classifier based on CNN can improve accuracy and improve stability."},{"name":"SegSTRONG-C: Segmenting Surgical Tools Robustly On Non-adversarial Generated Corruptions – An EndoVis’24 Challenge","publisher":"arXiv","releaseDate":"2024-07-16","url":"https://doi.org/10.48550/arXiv.2407.11906","summary":"Surgical data science has seen rapid advancement due to the excellent performance of end-to-end deep neural networks (DNNs) for surgical video analysis. Despite their successes, end-to-end DNNs have been proven susceptible to even minor corruptions, substantially impairing the model's performance. This vulnerability has become a major concern for the translation of cutting-edge technology, especially for high-stakes decision-making in surgical data science. We introduce SegSTRONG-C, a benchmark and challenge in surgical data science dedicated, aiming to better understand model deterioration under unforeseen but plausible non-adversarial corruption and the capabilities of contemporary methods that seek to improve it. Through comprehensive baseline experiments and participating submissions from widespread community engagement, SegSTRONG-C reveals key themes for model failure and identifies promising directions for improving robustness. The performance of challenge winners, achieving an average 0.9394 DSC and 0.9301 NSD across the unreleased test sets with corruption types: bleeding, smoke, and low brightness, shows inspiring improvement of 0.1471 DSC and 0.2584 NSD in average comparing to strongest baseline methods with UNet architecture trained with AutoAugment. In conclusion, the SegSTRONG-C challenge has identified some practical approaches for enhancing model robustness, yet most approaches relied on conventional techniques that have known, and sometimes quite severe, limitations. Looking ahead, we advocate for expanding intellectual diversity and creativity in non-adversarial robustness beyond data augmentation or training scale, calling for new paradigms that enhance universal robustness to corruptions and may enable richer applications in surgical data science."},{"name":"LEADS: Lightweight Embedded Assisted Driving System","publisher":"arXiv","releaseDate":"2024-10-23","url":"https://doi.org/10.48550/arXiv.2410.17554","summary":"With the rapid development of electric vehicles, formula races that face high school and university students have become more popular than ever as the threshold for design and manufacturing has been lowered. In many cases, we see teams inspired by or directly using toolkits and technologies inherited from standardized commercial vehicles. These architectures are usually overly complicated for amateur applications like the races. In order to improve the efficiency and simplify the development of instrumentation, control, and analysis systems, we propose LEADS (Lightweight Embedded Assisted Driving System), a dedicated solution for such scenarios."},{"name":"MIP Candy: A Modular PyTorch Framework for Medical Image Processing","publisher":"arXiv","releaseDate":"2026-02-24","url":"https://doi.org/10.48550/arXiv.2602.21033","summary":"Medical image processing demands specialized software that handles high-dimensional volumetric data, heterogeneous file formats, and domain-specific training procedures. Existing frameworks either provide low-level components that require substantial integration effort or impose rigid, monolithic pipelines that resist modification. We present MIP Candy (MIPCandy), a freely available, PyTorch-based framework designed specifically for medical image processing. MIPCandy provides a complete, modular pipeline spanning data loading, training, inference, and evaluation, allowing researchers to obtain a fully functional process workflow by implementing a single method, 𝚋𝚞𝚒𝚕𝚍_𝚗𝚎𝚝𝚠𝚘𝚛𝚔, while retaining fine-grained control over every component. Central to the design is 𝙻𝚊𝚢𝚎𝚛𝚃, a deferred configuration mechanism that enables runtime substitution of convolution, normalization, and activation modules without subclassing. The framework further offers built-in k-fold cross-validation, dataset inspection with automatic region-of-interest detection, deep supervision, exponential moving average, multi-frontend experiment tracking (Weights & Biases, Notion, MLflow), training state recovery, and validation score prediction via quotient regression. An extensible bundle ecosystem provides pre-built model implementations that follow a consistent trainer--predictor pattern and integrate with the core framework without modification. MIPCandy is open-source under the Apache-2.0 license and requires Python~3.12 or later."},{"name":"Artificial intelligence and radiologists in pancreatic cancer detection using standard of care CT scans (PANORAMA): an international, paired, non-inferiority, confirmatory, observational study","publisher":"Lancet Oncology","releaseDate":"2025-11-20","url":"https://doi.org/10.1016/S1470-2045(25)00567-4","summary":"Pancreatic ductal adenocarcinoma (PDAC) has the worst prognosis among major cancer types, primarily due to late diagnosis on contrast-enhanced CT. Artificial intelligence (AI) can improve diagnostic performance, but robust benchmarks and reliable comparison to radiologists' performance are scarce. We established an open-source benchmark with the aim of investigating AI systems for PDAC detection on CT and compared them to radiologists' performance, at scale."}],"languages":[{"language":"English","fluency":"Fluent","icon":""},{"language":"Mandarin","fluency":"First Language","icon":""}],"projects":[{"name":"LEADS","summary":"Lightweight Embedded Assisted Driving System","startDate":"2023-11-09","endDate":"2025-09-01","url":"https://leads.projectneura.org","highlights":["Developed an onboard instrumentation system that displays data like the wheel speed","Developed a webpage dashboard that remotely monitors the vehicles’ status from the Pit crew","Developed a multi-camera streaming and recording system","Developed support for saving and replaying vehicle data","Developed an efficient real-time data link using pure TCP/IP","Developed a data analysis tool set that teaches the driver how to drive","Customized the Ubuntu OS","Developed support for multiple screens","Developed GPS support"]},{"name":"MIP Candy","summary":"A Candy for Medical Image Processing","startDate":"2025-08-28","url":"https://mipcandy.projectneura.org","highlights":["Developed a framework that brings ready-to-use training, inference, and evaluation pipelines together with aesthetics, so users can focus on their experiments, not boilerplate","Developed a visualization system that helps the user see the complex data","Accelerated training with a preloading mechanism","Accelerated sliding window custom CUDA kernels"]},{"name":"The AIP Project","summary":"Automated Iterative Pseudo-labeling","startDate":"2025-09-01","highlights":["Proposed an innovative way to make pseudo-labeling more efficient and effective"]},{"name":"CIV102 Bridge Project","summary":"Best Winner Solution for Automated Calculation and Optimization with Extensive Docs","startDate":"2025-11-14","endDate":"2025-12-01","url":"https://github.com/ATATC/CIV102-Bridge-Project","highlights":["Top 1 in the cohort and 2nd in the class of 2025","Developed a complex cross-section composition and solving system","Developed a bridge solver","Calculated the optimal cross-section dimensions by turning the design into a COP (Convex Optimization Problem)"]}]}