{"basics":{"name":"Tianhao Fu","label":"AI Scientist","image":"/assets/img/portrait.png","email":"terry.fu@projectneura.org","url":"https://atatc.github.io","summary":"2T9 EngSci at University of Toronto; Research Team Lead at UTMIST; Intern at Vector Institute; Chief of Project Neura","location":{"city":"Toronto","countryCode":"CA","region":"Ontario"},"profiles":[{"network":"LinkedIn","username":"tianhao-fu-957188279","url":"https://www.linkedin.com/in/tianhao-fu-957188279"},{"network":"ORCID","username":"0009-0007-2342-5350","url":"https://orcid.org/0009-0007-2342-5350"},{"network":"Google Scholar","username":"_-yZgZ4AAAAJ","url":"https://scholar.google.com/citations?user=_-yZgZ4AAAAJ"},{"network":"X","username":"ATATC_A","url":"https://x.com/ATATC_A"}]},"work":[{"name":"Project Neura","position":"Chief","url":"https://projectneura.org","startDate":"2019-06-09","summary":"Gathering researchers and developers to bring their ideas into reality.","highlights":["Management"]},{"name":"Vector Institute (Bo Wang Lab)","position":"Intern","url":"https://vectorinstitute.ai","startDate":"2024-08-01","summary":"Competing in medical AI challenges presented by MICCAI.","highlights":["Computer Vision","Medical Image Processing"]},{"name":"UTMIST","position":"Research Team Lead","url":"https://utmist.ca","startDate":"2025-09-04","summary":"The AIP Project.","highlights":["Computer Vision","Medical Image Processing"]}],"education":[{"institution":"St. Thomas of Villanova College","location":"Canada","url":"https://www.villanovacollege.org","studyType":"OSSD","startDate":"2022-09-06","endDate":"2025-06-13","score":"97.33"},{"institution":"University of Toronto","location":"Canada","url":"https://www.engineering.utoronto.ca","area":"Engineering Science (PEY Co-op)","studyType":"BASc","startDate":"2025-09-02","score":"0","courses":["Machine Intelligence"]}],"publications":[{"name":"A deep learning model for accurate and robust internet traffic classification","publisher":"Applied and Computational Engineering","releaseDate":"2023-06-14","url":"https://doi.org/10.54254/2755-2721/6/20230939","summary":"Network traffic classification is significant due to the fast growth of the number of internet users. The traditional way of classifying the large number of traffic generated by these users is becoming less effective. Therefore, many researchers made a network traffic classifier based on deep learning. However, those classifiers do not provide far better results and perform poorly when dealing with encrypted information. This paper tries to approach highly accurate and robust results in both encrypted and unencrypted networks by using machine learning algorithms. The algorithm used is the convolutional neural network (CNN). The performance of the proposed CNN is compared with that of the classical LeNet-5 network. Experimental results show that the classifier based on the proposed CNN performed better when dealing with both encrypted and unencrypted datasets, achieving a maximum average accuracy of 83.55%. Moreover, it is not sensitive to hyper-parameter choices, indicating its superiority in robustness. Compared with traditional network classifiers, the network classifier based on CNN can improve accuracy and improve stability."},{"name":"SegSTRONG-C: Segmenting Surgical Tools Robustly On Non-adversarial Generated Corruptions – An EndoVis’24 Challenge","publisher":"arXiv","releaseDate":"2024-07-16","url":"https://doi.org/10.48550/arXiv.2407.11906","summary":"Surgical data science has seen rapid advancement due to the excellent performance of end-to-end deep neural networks (DNNs) for surgical video analysis. Despite their successes, end-to-end DNNs have been proven susceptible to even minor corruptions, substantially impairing the model's performance. This vulnerability has become a major concern for the translation of cutting-edge technology, especially for high-stakes decision-making in surgical data science. We introduce SegSTRONG-C, a benchmark and challenge in surgical data science dedicated, aiming to better understand model deterioration under unforeseen but plausible non-adversarial corruption and the capabilities of contemporary methods that seek to improve it. Through comprehensive baseline experiments and participating submissions from widespread community engagement, SegSTRONG-C reveals key themes for model failure and identifies promising directions for improving robustness. The performance of challenge winners, achieving an average 0.9394 DSC and 0.9301 NSD across the unreleased test sets with corruption types: bleeding, smoke, and low brightness, shows inspiring improvement of 0.1471 DSC and 0.2584 NSD in average comparing to strongest baseline methods with UNet architecture trained with AutoAugment. In conclusion, the SegSTRONG-C challenge has identified some practical approaches for enhancing model robustness, yet most approaches relied on conventional techniques that have known, and sometimes quite severe, limitations. Looking ahead, we advocate for expanding intellectual diversity and creativity in non-adversarial robustness beyond data augmentation or training scale, calling for new paradigms that enhance universal robustness to corruptions and may enable richer applications in surgical data science."},{"name":"LEADS: Lightweight Embedded Assisted Driving System","publisher":"arXiv","releaseDate":"2024-10-23","url":"https://doi.org/10.48550/arXiv.2410.17554","summary":"With the rapid development of electric vehicles, formula races that face high school and university students have become more popular than ever as the threshold for design and manufacturing has been lowered. In many cases, we see teams inspired by or directly using toolkits and technologies inherited from standardized commercial vehicles. These architectures are usually overly complicated for amateur applications like the races. In order to improve the efficiency and simplify the development of instrumentation, control, and analysis systems, we propose LEADS (Lightweight Embedded Assisted Driving System), a dedicated solution for such scenarios."}],"languages":[{"language":"English","fluency":"Fluent","icon":""},{"language":"Mandarin","fluency":"First Language","icon":""}],"projects":[{"name":"LEADS","summary":"Enable your racing car with powerful, data-driven instrumentation, control, and analysis systems, all wrapped up in a gorgeous look.","startDate":"2023-11-09","url":"https://leads.projectneura.org"}]}